{
  "transform_params" : {
    "image (120x120)" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_17__activation___output",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "name" : "conv2d_17",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "image (120x120)",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_17__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_17",
      "top" : "max_pooling2d_17_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_18__activation___output",
      "blob_weights" : 7,
      "K" : 32,
      "blob_biases" : 5,
      "name" : "conv2d_18",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "max_pooling2d_17_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_18__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_18",
      "top" : "max_pooling2d_18_output"
    },
    {
      "bottom" : "max_pooling2d_18_output",
      "weights" : {

      },
      "mode" : 1,
      "hint_fallback_from_metal" : 1,
      "top" : "flatten_9_output",
      "type" : "flatten",
      "name" : "flatten_9"
    },
    {
      "nB" : 25088,
      "top" : "dense_21__activation___output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 128,
      "blob_weights" : 11,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "flatten_9_output",
      "blob_biases" : 9,
      "has_tanh" : 0,
      "hint_fallback_from_metal" : 1,
      "name" : "dense_21",
      "has_prelu" : 0
    },
    {
      "nB" : 128,
      "top" : "dense_22__activation___output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 128,
      "blob_weights" : 15,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "dense_21__activation___output",
      "blob_biases" : 13,
      "has_tanh" : 0,
      "name" : "dense_22",
      "has_prelu" : 0
    },
    {
      "nB" : 128,
      "top" : "dense_23_output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 8,
      "blob_weights" : 19,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "dense_22__activation___output",
      "blob_biases" : 17,
      "has_tanh" : 0,
      "name" : "dense_23",
      "has_prelu" : 0
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "prediction",
      "type" : "softmax",
      "name" : "dense_23__activation__",
      "bottom" : "dense_23_output"
    }
  ]
}